Repository: dotnet/symreader-converter
Catalog: src/Microsoft.DiaSymReader.Converter/xlf/ConverterResources.*.xlf
Languages: cs, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidPdbFormat
source: Invalid PDB format: {0}
cs: Neplatný formát souboru PDB: {0}
es: Formato PDB no válido: {0}
fr: Format PDB non valide : {0}
it: Il formato del PDB non è valido: {0}
ja: PDB 形式は無効です: {0}
ko: 잘못된 PDB 형식: {0}
pl: Niepoprawny format pliku PDB: {0}
pt_br: Formato PDB inválido: {0}
ru: Недопустимый формат PDB: {0}
tr: Geçersiz PDB biçimi: {0}
zh_hans: PDB 格式无效: {0}
zh_hant: PDB 格式無效: {0}

# InvalidUserEntryPointInSourcePdb
source: Invalid user entry point in the source PDB
cs: Neplatný uživatelský vstupní bod ve zdrojovém souboru PDB
es: Punto de entrada de usuario no válido en el PDB de origen.
fr: Point d'entrée d'utilisateur non valide dans le PDB source
it: Il punto di ingresso utente nel PDB di origine non è valido
ja: ソース PDB のユーザー エントリ ポイントが無効です
ko: 소스 PDB의 잘못된 사용자 진입점
pl: Niepoprawny punkt wejścia użytkownika w źródłowym pliku PDB
pt_br: Ponto de entrada do usuário inválido no PDB de origem
ru: Недопустимая точка входа пользователя для исходного PDB
tr: Kaynak PDB’de geçersiz kullanıcı giriş noktası
zh_hans: 源 PDB 中的用户入口点无效
zh_hant: 來源 PDB 中的使用者進入點無效

source: Metadata not available
cs: Metadata nejsou dostupná.
es: Los metadatos no están disponibles.
fr: Métadonnées non disponibles
it: Metadati non disponibili
ja: メタデータを利用できません
ko: 메타데이터를 사용할 수 없음
pl: Metadane niedostępne
pt_br: Metadados não disponíveis
ru: Метаданные недоступны
tr: Meta veriler kullanılamıyor
zh_hans: 元数据不可用
zh_hant: 無法使用中繼資料

# SpecifiedPEBuiltWithPortablePdb
source: Specified PE was built with Portable PDB
cs: Zadaný přenositelný spustitelný soubor byl sestaven pomocí Portable PDB.
es: El archivo PE especificado se creó con un PDB portable.
fr: Le fichier PE spécifié a été généré avec un fichier PDB portable
it: Il file PE specificato è stato creato con PDB portabile
ja: 指定された PE は、移植可能な PDB でビルドされました
ko: 지정된 PE는 이식 가능한 PDB로 만들어졌습니다.
pl: Określony plik PE został skompilowany przy użyciu przenośnego pliku PDB
pt_br: O PE especificado foi criado com o PDB portátil
ru: Указанный PE-файл был создан с помощью переносимого PDB
tr: Belirtilen PE Taşınabilir PDB ile oluşturuldu
zh_hans: 指定的 PE 由可移植 PDB 构建
zh_hant: 指定的 PE 利用可攜式 PDB 所建置

# SpecifiedPEFileHasNoAssociatedPdb
source: Specified PE file doesn't have any PDB associated with it
cs: K zadanému přenositelnému spustitelnému souboru není přidružený žádný soubor PDB.
es: El archivo PE especificado no tiene ningún PDB asociado.
fr: Le fichier PE spécifié n'a pas de fichier PDB associé
it: Al file PE specificato non è associato alcun PDB
ja: 指定された PE ファイルには、PDB が関連付けられていません
ko: 지정된 PE 파일에 이와 연결된 PDB가 없습니다.
pl: Określony plik PE nie ma żadnego skojarzonego ze sobą pliku PDB
pt_br: O PE especificado não tem nenhum PDB associado a ele
ru: С указанным PE-файлом не связан ни один PDB
tr: Belirtilen PE dosyasıyla ilişkili PDB yok
zh_hans: 指定的 PE 文件未关联有任何 PDB
zh_hant: 指定的 PE 檔案沒有任何與其相關聯的 PDB

source: Stream must be readable
cs: Stream musí být možné číst.
es: La secuencia debe poderse leer.
fr: Le flux doit être lisible
it: Il flusso deve essere leggibile
ja: ストリームは読み取り可能である必要があります
ko: 스트림은 읽기 가능한 상태여야 합니다.
pl: Strumień musi być możliwy do odczytu
pt_br: O fluxo deve ser legível
ru: Поток должен быть доступен для чтения
tr: Akış okunabilir olmalıdır
zh_hans: 流必须可读
zh_hant: 資料流必須可讀取

source: Stream must be seakable
cs: Stream musí být možné prohledávat.
es: La secuencia debe poderse buscar.
fr: Le flux doit pouvoir être recherché
it: Il flusso deve supportare la ricerca
ja: ストリームはシーク可能である必要があります
ko: 스트림은 검색 가능한 상태여야 합니다.
pl: Strumień musi być możliwy do przeszukania
pt_br: O fluxo deve ser pesquisável
ru: Поток должен быть доступен для поиска
tr: Akış aranabilir olmalıdır
zh_hans: 流必须可查找
zh_hant: 資料流必須可搜尋

source: Stream must be writable
cs: Stream musí být možné zapisovat.
es: La secuencia debe poderse escribir.
fr: Le flux doit être accessible en écriture
it: Il flusso deve essere scrivibile
ja: ストリームは書き込み可能である必要があります
ko: 스트림은 쓰기 가능한 상태여야 합니다.
pl: Strumień musi być możliwy do zapisu
pt_br: O fluxo deve ser gravável
ru: Поток должен быть доступен для записи
tr: Akış yazılabilir olmalıdır
zh_hans: 流必须可写
zh_hant: 資料流必須可寫入

source: Method associated with local scope has no body
cs: Metoda přidružená k lokálnímu oboru nemá žádné tělo.
es: El método asociado al ámbito local no tiene cuerpo.
fr: La méthode associée à la portée locale n'a pas de corps
it: Il metodo associato all'ambito locale non contiene alcun corpo
ja: ローカル スコープに関連付けられたメソッドに本文がありません
ko: 로컬 범위에 연결된 메서드에 본문이 없습니다.
pl: Metoda skojarzona z lokalnym zakresem nie ma treści
pt_br: O método associado ao escopo local não tem corpo
ru: У метода, сопоставленного с локальной областью, нет тела
tr: Yerel kapsamla ilişkili yöntemin gövdesi yok
zh_hans: 与本地范围关联的方法没有主体
zh_hant: 與區域範圍相關聯的方法沒有任何主體

source: Method containing local variables has no local signature
cs: Metoda obsahující lokální proměnné nemá žádný lokální podpis.
es: El método que contiene variables locales no tiene una signatura local.
fr: La méthode contenant des variables locales n'a pas de signature locale
it: Il metodo che contiene le variabili locali non contiene alcuna firma locale
ja: ローカル変数を含むメソッドにローカル シグネチャがありません
ko: 지역 변수가 포함된 메서드에 지역 시그니처가 없습니다.
pl: Metoda zawierająca zmienne lokalne nie ma lokalnej sygnatury
pt_br: O método que contém variáveis locais não tem assinatura local
ru: У метода, содержащего локальные переменные, нет локальной сигнатуры
tr: Yerel değişkenleri içeren yöntemin yerel imzası yok
zh_hans: 包含局部变量的方法没有局部签名
zh_hant: 包含區域變數的方法沒有任何區域簽章

source: Local constant name too long
cs: Název lokální konstanty je příliš dlouhý.
es: El nombre de la constante local es demasiado largo.
fr: Nom de constante locale trop long
it: Il nome di costante locale è troppo lungo
ja: ローカル定数名が長すぎます
ko: 지역 상수 이름이 너무 깁니다.
pl: Za długa nazwa stałej lokalnej
pt_br: O nome da constante local é longo demais
ru: Имя локальной константы слишком длинное
tr: Yerel sabit ad çok uzun
zh_hans: 局部常量名称太长
zh_hant: 區域常數名稱太長

# LocalVariableNameTooLong
source: Local constant name too long
cs: Název lokální konstanty je příliš dlouhý.
es: El nombre de la constante local es demasiado largo.
fr: Nom de constante locale trop long
it: Il nome di costante locale è troppo lungo
ja: ローカル定数名が長すぎます
ko: 지역 상수 이름이 너무 깁니다.
pl: Za długa nazwa stałej lokalnej
pt_br: O nome da constante local é longo demais
ru: Имя локальной константы слишком длинное
tr: Yerel sabit ad çok uzun
zh_hans: 局部常量名称太长
zh_hant: 區域常數名稱太長

# ImportStringTooLong
source: Import string is too long. Ignoring the import: '{0}'
cs: Importovaný řetězec je příliš dlouhý. Import se ignoruje: {0}.
es: La importación de la cadena es demasiado larga. Ignorando la importación: "{0}"
fr: La chaîne d'importation est trop longue. Importation ignorée : '{0}'
it: La stringa di importazione è troppo lunga. L'importazione verrà ignorata: '{0}'
ja: インポート文字列が長すぎます。インポートを無視しています: '{0}'
ko: 가져오기 문자열이 너무 깁니다. 가져오기 무시: '{0}'
pl: Za długi ciąg importu. Ignorowanie importu: „{0}”
pt_br: A cadeia de caracteres de importação é longa demais. Ignorando a importação: '{0}'
ru: Строка импорта слишком длинная. Пропуск импорта: "{0}"
tr: İçeri aktarma dizesi çok uzun. İçeri aktarma yoksayılıyor: '{0}'
zh_hans: 导入字符串太长。正在忽略导入:“{0}”
zh_hant: 匯入字串太長。忽略匯入: '{0}'

source: Local scope ranges nesting is invalid
cs: Vnoření rozsahů lokálních oborů je neplatné.
es: El anidamiento de intervalos de ámbito local no es válido.
fr: L'imbrication des plages de portées locales est non valide
it: La voce di collegamento degli intervalli di ambito locale non è valida
ja: ローカル スコープの範囲の入れ子が無効です
ko: 로컬 범위 중첩이 잘못되었습니다.
pl: Zagnieżdżenie zakresów zakresu lokalnego jest nieprawidłowe
pt_br: O aninhamento de intervalos do escopo local é inválido
ru: Недопустимое вложение диапазонов для локальной области
tr: İç içe geçmiş yerel kapsam aralıkları geçersiz
zh_hans: 本地范围的范围嵌套无效
zh_hant: 區域範圍的範圍巢狀無效

# UnsupportedImportType
source: The type of import is not supported (type token {0:X8})
cs: Tento typ importu není podporovaný (token typu {0:X8}).
es: No se admite el tipo de importación (token de tipo {0:X8}).
fr: Le type d'importation n'est pas pris en charge (jeton de type {0:X8})
it: Il tipo di importazione non è supportato (token di tipo {0:X8})
ja: インポートの種類がサポートされていません (型トークン {0:X8})
ko: 가져오기 형식이 지원되지 않습니다(형식 토큰 {0:X8}).
pl: Typ importu nie jest obsługiwany (token typu {0:X8})
pt_br: Não há suporte ao tipo de importação (token do tipo {0:X8})
ru: Этот тип импорта не поддерживается (токен типа {0:X8})
tr: İçeri aktarma türü desteklenmiyor (tür belirteci {0:X8})
zh_hans: 导入类型不受支持(类型标记 {0:X8})
zh_hant: 不支援匯入類型 (型別語彙基元 {0:X8})

# UndefinedAssemblyReferenceAlias
source: An extern alias was not defined for assembly reference {0:X8}
cs: Pro odkaz na sestavení {0:X8} nebyl definován externí alias.
es: No se definió un alias externo para una referencia de ensamblado {0:X8}.
fr: Un alias externe n'a pas été défini pour la référence d'assembly {0:X8}
it: Non è stato definito alcun alias extern per il riferimento ad assembly {0:X8}
ja: extern エイリアスは、アセンブリ参照 {0:X8} に対して定義されませんでした
ko: 어셈블리 참조 {0:X8}에 별칭이 정의되지 않았습니다.
pl: Alias zewnętrzny nie został zdefiniowany dla odwołania zestawu {0:X8}
pt_br: Um alias externo não foi definido para a referência de assembly {0:X8}
ru: Не определен внешний псевдоним для ссылки на сборку {0:X8}
tr: {0:X8} derleme başvurusu için bir dış diğer ad tanımlanmadı
zh_hans: 未为程序集引用 {0:X8} 定义外部别名
zh_hant: 未對組件參考 {0:X8} 定義外部別名

# UnknownImportDefinitionKind
source: Unknown import definition kind: {0}
cs: Neznámý druh definice importu: {0}
es: Tipo de definición de importación desconocido: {0}
fr: Genre de définition d'importation inconnu : {0}
it: Tipo di definizione dell'importazione sconosciuto: {0}
ja: インポート定義の種類が不明です: {0}
ko: 알 수 없는 가져오기 정의 종류: {0}
pl: Nieznany rodzaj definicji importu: {0}
pt_br: Tipo de definição de importação desconhecido: {0}
ru: Неизвестный тип определения импорта: {0}
tr: Bilinmeyen içeri aktarma tanımı türü: {0}
zh_hans: 导入定义类型未知: {0}
zh_hant: 未知的匯入定義種類: {0}

# DiagnosticLocation
source: token 0x{0:X8}
fr: jeton 0x{0:X8}
ja: トークン 0x{0:X8}
ko: 토큰 0x{0:X8}
ru: Токен 0x{0:X8}
tr: belirteç 0x{0:X8}
zh_hans: 标记 0x{0:X8}
zh_hant: 語彙基元 0x{0:X8}

# ForwardedToUndefinedMethod
source: ForwardMethodInfo custom debug information forwards to non-existent method: 0x{0:X8}
cs: Vlastní ladicí informace ForwardMethodInfo se předávají neexistující metodě: 0x{0:X8}.
es: La información de depuración personalizada de ForwardMethodInfo se reenvía a un método no existente: 0x{0:X8}
fr: Les informations de débogage personnalisées de ForwardMethodInfo sont transmises à une méthode inexistante : 0x{0:X8}
it: Le informazioni di debug personalizzate di ForwardMethodInfo vengono inoltrate a un metodo non esistente: 0x{0:X8}
ja: ForwardMethodInfo カスタム デバッグ情報は、存在しないメソッドに転送されます: 0x{0:X8}
ko: ForwardMethodInfo 사용자 지정 디버그 정보가 존재하지 않는 메서드로 전달됩니다. 0x{0:X8}
pl: Niestandardowe informacje debugowania ForwardMethodInfo są przekazywane do nieistniejącej metody: 0x{0:X8}
pt_br: As informações de depuração personalizadas ForwardMethodInfo são encaminhadas para um método não existente: 0x{0:X8}
ru: Пользовательская отладочная информация ForwardMethodInfo переадресовывается в несуществующий метод: 0x{0:X8}
tr: ForwardMethodInfo özel hata ayıklama bilgileri var olmayan yönteme iletiyor: 0x{0:X8}
zh_hans: ForwardMethodInfo 自定义调试信息转发到不存在的方法: 0x{0:X8}
zh_hant: ForwardMethodInfo 自訂偵錯資訊轉寄至不存在的方法: 0x{0:X8}

# ForwardedToMethodWithNoScope
source: ForwardMethodInfo custom debug information forwards to a method with no scope: 0x{0:X8}
cs: Vlastní ladicí informace ForwardMethodInfo se předávají metodě bez oboru: 0x{0:X8}.
es: La información de depuración personalizada de ForwardMethodInfo se reenvía a un método sin ámbito: 0x{0:X8}
fr: Les informations de débogage personnalisées de ForwardMethodInfo sont transmises à une méthode sans portée : 0x{0:X8}
it: Le informazioni di debug personalizzate di ForwardMethodInfo vengono inoltrate a un metodo senza ambito: 0x{0:X8}
ja: ForwardMethodInfo カスタム デバッグ情報は、スコープなしのメソッドに転送されます: 0x{0:X8}
ko: ForwardMethodInfo 사용자 지정 디버그 정보가 범위가 없는 메서드로 전달됩니다. 0x{0:X8}
pl: Niestandardowe informacje debugowania ForwardMethodInfo są przekazywane do metody bez zakresu: 0x{0:X8}
pt_br: As informações de depuração personalizadas ForwardMethodInfo são encaminhadas para um método sem escopo: 0x{0:X8}
ru: Пользовательская отладочная информация ForwardMethodInfo переадресовывается в метод без области: 0x{0:X8}
tr: ForwardMethodInfo özel hata ayıklama bilgileri kapsamı olmayan bir yönteme iletiyor: 0x{0:X8}
zh_hans: ForwardMethodInfo 自定义调试信息转发到没有范围的方法: 0x{0:X8}
zh_hant: ForwardMethodInfo 自訂偵錯資訊轉寄至沒有範圍的方法: 0x{0:X8}

# BothForwardMethodInfoAndImportsSpecified
source: Both ForwardMethodInfo custom debug information and imports are specified
cs: Jsou zadané jak vlastní ladicí informace ForwardMethodInfo, tak importy.
es: Se especifican tanto las importaciones como la información de depuración personalizada ForwardMethodInfo.
fr: Les informations de débogage personnalisées et les importations de ForwardMethodInfo sont spécifiées
it: Sono specificate sia le importazioni che le informazioni di debug personalizzate di ForwardMethodInfo
ja: ForwardMethodInfo カスタム デバッグ情報とインポートの両方が指定されています
ko: ForwardMethodInfo 사용자 지정 디버그 정보와 가져오기가 모두 지정되었습니다.
pl: Zostały określone zarówno niestandardowe informacje debugowania ForwardMethodInfo, jak i importy
pt_br: As importações e informações de depuração personalizadas ForwardMethodInfo são especificadas
ru: Указаны как пользовательские сведения об отладке ForwardMethodInfo, так и импорты
tr: ForwardMethodInfo özel hata ayıklama bilgileri ve içeri aktarmalarının ikisi birden belirtildi
zh_hans: ForwardMethodInfo 自定义调试信息和导入均已指定
zh_hant: 同時指定了 ForwardMethodInfo 自訂偵錯資訊與匯入

# InvalidStateMachineTypeName
source: Invalid type name specified in StateMachineTypeName custom debug information: {0}
cs: Ve vlastních ladicích informacích StateMachineTypeName je zadaný neplatný název typu: {0}.
es: Se especificó un nombre de tipo no válido en la información de depuración personalizada de StateMachineTypeName: {0}
fr: Nom de type non valide spécifié dans les informations de débogage personnalisées de StateMachineTypeName : {0}
it: Il nome di tipo specificato nelle informazioni di debug personalizzate di StateMachineTypeName non è valido: {0}
ja: StateMachineTypeName カスタム デバッグ情報で指定された型名が無効です: {0}
ko: StateMachineTypeName 사용자 지정 디버그 정보에서 지정된 잘못된 형식 이름: {0}
pl: Określono niepoprawną nazwę typu w niestandardowych informacjach debugowania StateMachineTypeName: {0}
pt_br: Nome de tipo inválido especificado nas informações de depuração personalizadas StateMachineTypeName: {0}
ru: В пользовательской отладочной информации StateMachineTypeName указано неправильное имя типа: {0}
tr: StateMachineTypeName özel hata ayıklama bilgilerinde geçersiz tür adı belirtildi: {0}
zh_hans: 在 StateMachineTypeName 自定义调试信息中指定的类型名称无效: {0}
zh_hant: StateMachineTypeName 自訂偵錯資訊中指定的類型名稱無效: {0}

# BothStateMachineTypeNameAndImportsSpecified
source: Both StateMachineTypeName custom debug information and imports are specified
cs: Jsou zadané jak vlastní ladicí informace StateMachineTypeName, tak importy.
es: Se especifican tanto las importaciones como la información de depuración personalizada de StateMachineTypeName.
fr: Les informations de débogage personnalisées et les importations de StateMachineTypeName sont spécifiées
it: Sono specificate sia le importazioni che le informazioni di debug personalizzate di StateMachineTypeName
ja: StateMachineTypeName カスタム デバッグ情報とインポートの両方が指定されています
ko: StateMachineTypeName 사용자 지정 디버그 정보와 가져오기가 모두 지정되었습니다.
pl: Zostały określone zarówno niestandardowe informacje debugowania StateMachineTypeName, jak i importy
pt_br: As importações e informações de depuração personalizadas StateMachineTypeName são especificadas
ru: Указаны как пользовательские сведения об отладке StateMachineTypeName, так и импорты
tr: StateMachineTypeName özel hata ayıklama bilgileri ve içeri aktarmalarının ikisi birden belirtildi
zh_hans: StateMachineTypeName 自定义调试信息和导入均已指定
zh_hant: 同時指定了 StateMachineTypeName 自訂偵錯資訊與匯入

# DuplicateDynamicLocals
source: Multiple DynamicLocals custom debug information records specified for the same local variable slot: {0}
cs: Pro stejný slot lokální proměnné je zadaných několik vlastních ladicích informací DynamicLocals: {0}.
es: Se especificaron varios registros de información de depuración personalizada de DynamicLocals para el mismo espacio de variables locales: {0}
fr: Plusieurs enregistrements relatifs aux informations de débogage personnalisées de DynamicLocals ont été spécifiés pour le même emplacement de variable locale : {0}
it: Sono stati specificati più record di informazioni di debug personalizzate di DynamicLocals per lo stesso slot di variabile locale: {0}
ja: 同じローカル変数スロットに複数の DynamicLocals カスタム デバッグ情報レコードが指定されました: {0}
ko: 동일한 지역 변수 슬롯에 대해 지정된 여러 DynamicLocals 사용자 지정 디버그 정보 레코드: {0}
pl: Określono wiele rekordów niestandardowych informacji debugowania DynamicLocals dla tego samego gniazda zmiennej lokalnej: {0}
pt_br: Vários registros de informações de depuração personalizadas DynamicLocals para o mesmo slot variável local: {0}
ru: Для одного слота локальной переменной указано несколько записей пользовательской отладочной информации DynamicLocals: {0}
tr: Aynı yerel değişken yuvası için birden çok DynamicLocals özel hata ayıklama bilgileri kaydı belirtildi: {0}
zh_hans: 为同一局部变量槽指定了多个 DynamicLocals 自定义调试信息记录: {0}
zh_hant: 為同一個區域變數位置 {0} 指定了多個 DynamicLocals 自訂偵錯資訊記錄

# DuplicateTupleElementNamesForSlot
source: Multiple TupleElementNames custom debug information records specified for the same local variable slot: {0}
cs: Pro stejný slot lokální proměnné je zadaných několik vlastních ladicích informací TupleElementNames: {0}.
es: Se especificaron varios registros de información de depuración personalizada de TupleElementNames para el mismo espacio de variables locales: {0}
fr: Plusieurs enregistrements relatifs aux informations de débogage personnalisées de TupleElementNames ont été spécifiés pour le même emplacement de variable locale : {0}
it: Sono stati specificati più record di informazioni di debug personalizzate di TupleElementNames per lo stesso slot di variabile locale: {0}
ja: 同じローカル変数スロットに複数の TupleElementNames カスタム デバッグ情報レコードが指定されました: {0}
ko: 동일한 지역 변수 슬롯에 대해 지정된 여러 TupleElementNames 사용자 지정 디버그 정보 레코드: {0}
pl: Określono wiele rekordów niestandardowych informacji debugowania TupleElementNames dla tego samego gniazda zmiennej lokalnej: {0}
pt_br: Vários registros de informações de depuração personalizadas TupleElementNames para o mesmo slot variável local: {0}
ru: Для одного слота локальной переменной указано несколько записей пользовательской отладочной информации TupleElementNames: {0}
tr: Aynı yerel değişken yuvası için birden çok TupleElementNames özel hata ayıklama bilgileri kaydı belirtildi: {0}
zh_hans: 为同一局部变量槽指定了多个 TupleElementNames 自定义调试信息记录: {0}
zh_hant: 為同一個區域變數位置 {0} 指定了多個 TupleElementNames 自訂偵錯資訊記錄

# DuplicateTupleElementNamesForConstant
source: Multiple TupleElementNames custom debug information records specified for the same local constant: '{0}' [{1}, {2})
cs: Pro stejnou lokální konstantu je zadaných několik vlastních ladicích informací TupleElementNames: {0} [{1}, {2})
es: Se especificaron varios registros de información de depuración personalizada de TupleElementNames para la misma constante local: “{0}” [{1}, {2})
fr: Plusieurs enregistrements relatifs aux informations de débogage personnalisées de TupleElementNames ont été spécifiés pour la même constante locale : '{0}' [{1}, {2})
it: Sono stati specificati più record di informazioni di debug personalizzate di TupleElementNames per la stessa costante locale: '{0}' [{1}, {2})
ja: 同じローカル定数に複数の TupleElementNames カスタム デバッグ情報レコードが指定されました: {0} [{1}, {2})
ko: 동일한 지역 상수 슬롯에 대해 지정된 여러 TupleElementNames 사용자 지정 디버그 정보 레코드: '{0}' [{1}, {2})
pl: Określono wiele rekordów niestandardowych informacji debugowania TupleElementNames dla tej samej stałej lokalnej: „{0}” [{1}, {2})
pt_br: Vários registros de informações de depuração personalizadas TupleElementNames para a mesma constante local: '{0}' [{1}, {2})
ru: Для одной локальной константы указано несколько записей пользовательской отладочной информации TupleElementNames: "{0}" [{1}, {2})
tr: Aynı yerel sabit değer için birden çok TupleElementNames özel hata ayıklama bilgileri kaydı belirtildi: '{0}' [{1}, {2})
zh_hans: 为同一局部常量指定了多个 TupleElementNames 自定义调试信息记录:“{0}” [{1}, {2})
zh_hant: 為同一個區域常數 '{0}' [{1}, {2}) 指定了多個 TupleElementNames 自訂偵錯資訊記錄

# InvalidImportStringFormat
source: The format of import string is invalid: '{0}'
cs: Formát importovaného řetězce je neplatný: {0}.
es: El formato de la cadena de importación no es válido: “{0}”
fr: Le format de la chaîne d'importation est non valide : '{0}'
it: Il formato della stringa di importazione non è valido: '{0}'
ja: インポート文字列の形式が無効です: '{0}'
ko: 가져오기 문자열 형식이 잘못되었습니다. '{0}'
pl: Format ciągu importu jest nieprawidłowy: „{0}”
pt_br: O formato da cadeia de caracteres de importação é inválido: '{0}'
ru: Недопустимый формат строки импорта: "{0}"
tr: İçeri aktarma dizesi biçimi geçersiz: '{0}'
zh_hans: 导入字符串的格式无效:“{0}”
zh_hant: 匯入字串的格式無效: '{0}'

# InvalidEntryPointToken
source: The format of import string is invalid: '{0}'
cs: Formát importovaného řetězce je neplatný: {0}.
es: El formato de la cadena de importación no es válido: “{0}”
fr: Le format de la chaîne d'importation est non valide : '{0}'
it: Il formato della stringa di importazione non è valido: '{0}'
ja: インポート文字列の形式が無効です: '{0}'
ko: 가져오기 문자열 형식이 잘못되었습니다. '{0}'
pl: Format ciągu importu jest nieprawidłowy: „{0}”
pt_br: O formato da cadeia de caracteres de importação é inválido: '{0}'
ru: Недопустимый формат строки импорта: "{0}"
tr: İçeri aktarma dizesi biçimi geçersiz: '{0}'
zh_hans: 导入字符串的格式无效:“{0}”
zh_hant: 匯入字串的格式無效: '{0}'

# InvalidScopeILOffsetRange
source: Invalid scope IL offset range: [{0}, {1})
cs: Neplatný rozsah posunu IL oboru: [{0}, {1})
es: Intervalo de desplazamiento IL de ámbito no válido: [{0}, {1})
fr: La plage d'offset IL a une portée non valide : [{0}, {1})
it: L'intervallo di offset IL per l'ambito non è valido: [{0}, {1})
ja: スコープの IL オフセットの範囲が無効です: [{0}, {1})
ko: 잘못된 범위 IL 오프셋 범위: [{0}, {1})
pl: Nieprawidłowy zakres zakresu przesunięcia IL: [{0}, {1})
pt_br: Intervalo de deslocamento de IL de escopo inválido: [{0}, {1})
ru: Недопустимый диапазон смещения IL для области: [{0}, {1})
tr: Kapsam IL uzaklık aralığı geçersiz: [{0}, {1})
zh_hans: 范围 IL 的偏移量范围无效: [{0}, {1})
zh_hant: 範圍 IL 位移範圍無效: [{0}, {1})

source: Invalid local variable data
cs: Neplatná data lokální proměnné
es: Los datos de la variable local no son válidos.
fr: Données de variable locale non valides
it: I dati della variabile locale non sono validi
ja: ローカル変数データが無効です
ko: 잘못된 지역 변수 데이터
pl: Nieprawidłowe dane zmiennej lokalnej
pt_br: Dados variáveis locais inválidos
ru: Недопустимые данные локальной переменной
tr: Yerel değişken verileri geçersiz
zh_hans: 局部变量数据无效
zh_hant: 區域變數資料無效

source: Invalid local constant data
cs: Neplatná data lokální konstanty
es: Los datos de la constante local no son válidos.
fr: Données de constante locale non valides
it: I dati della costante locale non sono validi
ja: ローカル定数データが無効です
ko: 잘못된 지역 상수 데이터
pl: Nieprawidłowe dane stałej lokalnej
pt_br: Dados constantes locais inválidos
ru: Недопустимые данные локальной константы
tr: Yerel sabit değer verileri geçersiz
zh_hans: 局部常量数据无效
zh_hant: 區域常數資料無效
