Repository: dotnet/symreader-converter
Catalog: src/Microsoft.DiaSymReader.Converter/xlf/ConverterResources.*.xlf
Languages: cs, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidLocalConstantSignature
source: Invalid local constant signature: '{0}'
cs: Neplatný podpis lokální konstanty: {0}
es: La signatura de la constante local no es válida: “{0}”
fr: Signature de constante locale non valide : '{0}'
it: La firma della costante locale non è valida: '{0}'
ja: ローカル定数シグネチャが無効です: '{0}'
ko: 잘못된 지역 상수 시그니처: '{0}'
pl: Nieprawidłowa sygnatura stałej lokalnej: „{0}”
pt_br: Assinatura constante local inválida: '{0}'
ru: Недопустимая сигнатура локальной константы: "{0}"
tr: Yerel sabit değer imzası geçersiz: '{0}'
zh_hans: 局部常量签名无效:“{0}”
zh_hant: 區域常數簽章無效: '{0}'

source: Invalid local scope
cs: Neplatný lokální obor
es: El ámbito local no es válido.
fr: Portée locale non valide
it: L'ambito locale non è valido
ja: ローカル スコープが無効です
ko: 잘못된 로컬 범위
pl: Nieprawidłowy zakres lokalny
pt_br: Escopo local inválido
ru: Недопустимая локальная область
tr: Yerel kapsam geçersiz
zh_hans: 本地范围无效
zh_hant: 區域範圍無效

# InvalidSequencePointDocument
source: Invalid sequence point document name: '{0}'
cs: Neplatný název dokumentu sekvenčního bodu: {0}
es: El nombre del documento de puntos de secuencia no es válido: “{0}”
fr: Nom de document de point de séquence non valide : '{0}'
it: Il nome del documento dei punti di sequenza non è valido: '{0}'
ja: シーケンス ポイントのドキュメント名が無効です: '{0}'
ko: 잘못된 시퀀스 점 문서 이름: '{0}'
pl: Nieprawidłowa nazwa dokumentu punktu sekwencji: „{0}”
pt_br: Nome do documento de ponto de sequência inválido: '{0}'
ru: Недопустимое имя документа для точки последовательности: "{0}"
tr: Sıra noktası belge adı geçersiz: '{0}'
zh_hans: 序列点文档名无效:“{0}”
zh_hant: 序列點文件名稱無效: '{0}'

# UnmappedDocumentName
source: Document name doesn't match any pattern in Source Link: '{0}'
cs: Název dokumentu neodpovídá žádnému vzoru ve zdrojovém odkazu: {0}.
es: El nombre del documento no coincide con ningún patrón del vínculo de origen: “{0}”
fr: Le nom du document ne correspond à aucun modèle dans le lien source : '{0}'
it: Il nome del documento non corrisponde ad alcun criterio nel collegamento all'origine: '{0}'
ja: ドキュメント名は、ソース リンク内のどのパターンとも一致しません: '{0}'
ko: 문서 이름과 일치하는 소스 링크 패턴이 없습니다. '{0}'
pl: Nazwa dokumentu nie jest zgodna z żadnym wzorcem w linku źródłowym: „{0}”
pt_br: O nome do documento não corresponde a nenhum padrão no Link de origem: '{0}'
ru: Имя документа не соответствует ни одному из шаблонов в исходной ссылке: "{0}"
tr: Belge adı Kaynak Bağlantıdaki herhangi bir örnekle eşleşmiyor: '{0}'
zh_hans: 文档名称与源链接中的任何模式均不匹配:“{0}”
zh_hant: 文件名稱不符合來源連結 '{0}' 中的任一模式

# PdbNotMatchingDebugDirectory
source: The PDB doesn't match debug directory record in the PE file
cs: Soubor PDB nesouhlasí se záznamem adresáře ladění v přenositelném spustitelném souboru.
es: El PDB no coincide con el registro del directorio de depuración del archivo PE.
fr: Le fichier PDB ne correspond pas à l'enregistrement du répertoire de débogage dans le fichier PE
it: Il PDB non corrisponde al record della directory di debug nel file PE
ja: PDB は、PE ファイル内のデバッグ ディレクトリ レコードと一致しません
ko: PDB가 PE 파일의 디버그 디렉터리 레코드와 일치하지 않습니다.
pl: Plik PDB nie jest zgodny z rekordem katalogu debugowania w pliku PE
pt_br: O PDB não corresponde ao registro de diretório de depuração no arquivo PE
ru: PDB не соответствует записи каталога отладки в PE-файле
tr: PDB, PE dosyasındaki hata ayıklama dizini kaydıyla eşleşmiyor
zh_hans: PDB 与 PE 文件中的调试目录记录不匹配
zh_hant: PDB 與 PE 檔案中的偵錯目錄記錄不符

source: Invalid Source Link data
cs: Neplatná data zdrojového odkazu
es: Los datos del vínculo de origen no son válidos.
fr: Données de lien source non valides
it: I dati del collegamento all'origine non sono validi
ja: ソース リンク データが無効です
ko: 잘못된 소스 링크 데이터
pl: Nieprawidłowe dane linku źródłowego
pt_br: Dados de Link de origem inválidos
ru: Недопустимые данные исходной ссылки
tr: Kaynak Bağlantı verileri geçersiz
zh_hans: 源链接数据无效
zh_hant: 來源連結資料無效

# InvalidSourceServerData
source: Invalid srcsrv data
cs: Neplatná data srcsrv
es: Los datos srcsrv no son válidos.
fr: Données srcsrv non valides
it: I dati srcsrv non sono validi
ja: srcsrv データが無効です
ko: 잘못된 srcsrv 데이터
pl: Nieprawidłowe dane srcsrv
pt_br: Dados srcsrv inválidos
ru: Недопустимые данные SRCSRV
tr: Srcsrv verileri geçersiz
zh_hans: srcsrv 数据无效
zh_hant: srcsrv 資料無效

# InvalidEmbeddedSource
source: Invalid embedded source associated with document '{0}'
cs: K dokumentu {0} je přidružený neplatný vložený zdroj.
es: El documento “{0}” tiene asociado un origen incrustado no válido.
fr: Source incorporée non valide associée au document '{0}'
it: L'origine incorporata associata al documento '{0}' non è valida
ja: ドキュメント '{0}' に関連付けられた埋め込みソースが無効です
ko: '{0}' 문서에 연결된 잘못된 포함 소스
pl: Nieprawidłowe osadzone źródło skojarzone z dokumentem „{0}”
pt_br: Origem inserida inválida associada ao documento '{0}'
ru: С документом "{0}" сопоставлен недопустимый внедренный источник
tr: '{0}' belgesiyle ilişkilendirilen eklenmiş kaynak geçersiz
zh_hans: 与文档“{0}”关联的嵌入源无效
zh_hant: 與文件 '{0}' 相關聯的內嵌來源無效

# InconsistentStateMachineMethodMapping
source: Inconsistent state machine method mapping -- MoveNext method is associated with two distinct kickoff methods: 0x{0:X8} and 0x{1:X8}
cs: Nekonzistentní mapování metod stavového stroje – metoda MoveNext je přidružená ke dvěma odlišným zahajovacím metodám: 0x{0:X8} a 0x{1:X8}.
es: La asignación de métodos de la máquina de estados no es coherente: el método MoveNext está asociado a dos métodos distintos de puesta en marcha: 0x{0:X8} y 0x{1:X8}
fr: Mappage de méthode de machine à états incohérent -- La méthode MoveNext est associée à deux méthodes de démarrage distinctes : 0x{0:X8} et 0x{1:X8}
it: Il mapping dei metodi delle macchine a stati non è coerente. Il metodo MoveNext è associato a due distinti metodi di avvio: 0x{0:X8} e 0x{1:X8}
ja: ステート マシン メソッド マッピングに一貫性がありません -- MoveNext メソッドは、2 つの異なる開始メソッドに関連付けられています: 0x{0:X8} および 0x{1:X8}
ko: 일관되지 않은 상태의 컴퓨터 메서드 매핑 -- MoveNext 메서드가 2가지 고유 킥오프 메서드인 0x{0:X8} 및 0x{1:X8}에 연결되었습니다.
pl: Niespójne mapowanie metody automatu stanów — metoda MoveNext jest skojarzona z dwoma różnymi metodami rozpoczęcia: 0x{0:X8} i 0x{1:X8}
pt_br: Mapeamento de método de máquina de estado inconsistente -- o método MoveNext é associado a dois métodos de início distintos: 0x{0:X8} e 0x{1:X8}
ru: Недопустимое сопоставление методов конечного автомата — метод MoveNext сопоставлен с двумя отдельными начальными методами: 0x{0:X8} и 0x{1:X8}
tr: Tutarsız durum makine yöntemi eşlemesi -- MoveNext yöntemi iki farklı başlangıç yöntemiyle ilişkilendirilmiş: 0x{0:X8} ve 0x{1:X8}
zh_hans: 状态机方法映射不一致 -- MoveNext 方法与两种不同的开始方法: 0x{0:X8} 和 0x{1:X8} 相关联
zh_hant: 狀態機器方法對應不一致 -- MoveNext 方法與兩個不同的 kickoff 方法相關聯: 0x{0:X8} 與 0x{1:X8}

# InvalidJsonDataFormat
source: The JSON format is invalid
cs: Formát JSON je neplatný.
es: El formato JSON no es válido.
fr: Le format JSON est non valide
it: Il formato JSON non è valido
ja: JSON 形式が無効です
ko: JSON 형식이 잘못되었습니다.
pl: Format JSON jest nieprawidłowy
pt_br: O formato JSON é inválido
ru: Недопустимый формат JSON
tr: JSON biçimi geçersiz
zh_hans: JSON 格式无效
zh_hant: JSON 格式無效

# InvalidSourceLink
source: Invalid Source Link: {0}
cs: Neplatný zdrojový odkaz: {0}
es: Vínculo de origen no válido: {0}
fr: Lien source non valide : {0}
it: Il collegamento all'origine non è valido: {0}
ja: 無効なソース リンク: {0}
ko: 잘못된 소스 링크: {0}
pl: Nieprawidłowy link źródłowy: {0}
pt_br: Link de origem inválido: {0}
ru: Недопустимая исходная ссылка: {0}
tr: Kaynak Bağlantı geçersiz: {0}
zh_hans: 源链接无效: {0}
zh_hant: 來源連結無效: {0}

# InvalidSrcSvrVariableName
source: Invalid srcsvr variable name: '{0}'
cs: Neplatný název proměnné srcsvr: {0}
es: Nombre de variable srcsvr no válida: "{0}"
fr: Nom de la variable srcsvr non valide : '{0}'
it: Il nome della variabile srcsvr non è valido: '{0}'
ja: srcsvr 変数名が無効です: '{0}'
ko: 잘못된 srcsvr 변수 이름: '{0}'
pl: Nieprawidłowa nazwa zmiennej srcsvr: „{0}”
pt_br: Nome da variável srcsvr inválido: '{0}'
ru: Недопустимое имя переменной srcsvr: "{0}"
tr: Geçersiz srcsvr değişkeni adı: '{0}'
zh_hans: srcsvr 变量名称无效:“{0}”
zh_hant: srcsvr 變數名稱無效: '{0}'

# ReservedSrcSvrVariableName
source: Variable '{0}' can't be set explicitly
cs: Proměnnou {0} nejde nastavit explicitně.
es: La variable "{0}" no se puede establecer explícitamente.
fr: Impossible de définir explicitement la variable '{0}'
it: Non è possibile impostare in modo esplicito la variabile '{0}'
ja: 変数 '{0}' を明示的に設定できません
ko: 변수 '{0}'을(를) 명시적으로 설정할 수 없습니다.
pl: Nie można jawnie ustawić zmiennej „{0}”
pt_br: A variável '{0}' não pode ser definida de modo explícito
ru: Переменную "{0}" невозможно задать явно
tr: '{0}' değişkeni açıkça ayarlanamaz
zh_hans: 无法显式设置变量“{0}”
zh_hant: 無法明確設定變數 '{0}'

# InvalidSrcSvrVariableValue
source: Value of srcsvr variable '{0}' contains invalid characters
cs: Hodnota proměnné srcsvr {0} obsahuje neplatné znaky.
es: El valor de la variable srcsvr de "{0}" contiene caracteres no válidos
fr: La valeur de la variable srcsvr '{0}' contient des caractères non valides
it: Il valore della variabile srcsvr '{0}' contiene caratteri non validi
ja: srcsvr 変数 '{0}' の値に無効な文字が含まれています
ko: srcsvr 변수 '{0}'의 값에 잘못된 문자가 포함되어 있습니다.
pl: Wartość zmiennej srcsvr „{0}” zawiera nieprawidłowe znaki
pt_br: O valor da variável srcsvr '{0}' contém caracteres inválidos
ru: Значение переменной srcsvr "{0}" содержит недопустимые символы
tr: '{0}' adlı srcsvr değişkeninin değeri geçersiz karakterler içeriyor
zh_hans: srcsvr 变量“{0}”的值包含无效字符
zh_hant: srcsvr 變數 '{0}' 的值包含無效字元

# MalformedSourceLinkUrl
source: Malformed Source Link URL: '{0}'
cs: Nesprávně vytvořená adresa URL zdrojového odkazu: {0}
es: URL del vínculo de origen con formato incorrecto: “{0}”
fr: URL de lien source incorrecte : '{0}'
it: L'URL del collegamento all'origine non è valido: '{0}'
ja: ソース リンク URL の形式が正しくありません: '{0}'
pl: Nieprawidłowo sformułowany adres URL linku źródłowego: „{0}”
pt_br: URL de Link de origem malformada: '{0}'
ru: Неверный формат URL исходной ссылки: "{0}"
tr: Hatalı Kaynak Bağlantısı URL’si: '{0}'
zh_hans: 源链接 URL 格式错误:“{0}”
zh_hant: 來源連結 URL 的格式錯誤: '{0}'

# UrlSchemeIsNotHttp
source: The scheme of URL specified in Source Link is not http/https: '{0}'
cs: Schéma adresy URL zadané ve zdrojovém odkazu není http/https: {0}.
es: El esquema de la dirección URL especificada en el vínculo de origen no es http ni https: “{0}”
fr: Le schéma d'URL spécifié dans le lien source n'est pas http/https: '{0}'
it: Lo schema dell'URL specificato nel collegamento all'origine non è http/https: '{0}'
ja: ソース リンクで指定された URL のスキームが http/https ではありません: '{0}'
pl: Schemat adresu URL określony w linku źródłowym jest inny niż http/https: „{0}”
pt_br: O esquema da URL especificada no Link de origem não é http/https: '{0}'
ru: Указанная в исходной ссылке схема URL отличается от http/https: "{0}"
tr: Kaynak Bağlantısında belirtilen URL düzeni http/https değil: '{0}'
zh_hans: 源链接中指定的 URL 方案不是 http/https:“{0}”
zh_hant: 來源連結中指定的 URI 配置不是 http/https: '{0}'

# NoSupportedUrlsFoundInSourceLink
source: No supported well-formed URLs found in Source Link
cs: Ve zdrojovém odkazu se nenašly žádné podporované správně vytvořené adresy URL.
es: En el vínculo de origen, no se han encontrado direcciones URL admitidas con el formato correcto
fr: URL incorrectes non prises en charge dans le lien source
it: Non sono stati trovati URL ben formati supportati nel collegamento all'origine
ja: ソース リンク内にサポートされる適切な形式の URL が見つかりません
pl: Nie odnaleziono obsługiwanych i prawidłowo sformułowanych adresów URL w linku źródłowym
pt_br: URLs bem formadas incompatíveis encontradas no Link de origem
ru: В исходной ссылке не найдено поддерживаемых URL в допустимом формате
tr: Kaynak Bağlantısında desteklenen doğru biçimlendirilmiş URL bulunamadı
zh_hans: 源链接中找不到任何支持的格式正确的 URL
zh_hant: 在來源連結中找不到所支援格式正確的 URL

# SourceChecksumAlgorithmSizeMismatch
source: Source file checksum size doesn't match the hash algorithm '{0}': '{1}'
cs: Velikost kontrolního součtu zdrojového souboru neodpovídá hashovacímu algoritmu {0}: {1}.
es: El tamaño de la suma de comprobación del archivo de origen no coincide con el algoritmo hash "{0}": "{1}"
fr: La taille de somme de contrôle du fichier source ne correspond pas à l'algorithme de hachage '{0}' : '{1}'
it: Le dimensioni del checksum del file di origine non corrispondono all'algoritmo hash '{0}': '{1}'
ja: ソース ファイル チェックサム サイズは、ハッシュ アルゴリズム '{0}' と一致しません: '{1}'
pl: Rozmiar sumy kontrolnej pliku źródłowego nie jest zgodny z algorytmem wyznaczania wartości skrótu „{0}”: „{1}”
pt_br: O tamanho da soma de verificação do arquivo de origem não corresponde ao algoritmo de hash '{0}': '{1}'
ru: Размер контрольной суммы исходного файла не соответствует хэш-алгоритму "{0}": "{1}"
tr: Kaynak dosyasının sağlama toplamı boyutu '{0}' karma algoritmasıyla eşleşmiyor: '{1}'
zh_hans: 源文件校验和大小与哈希算法“{0}”不匹配:“{1}”
zh_hant: 來源檔案總和大小與雜湊演算法 '{0}' 不符: '{1}'

source: none
cs: žádné
es: ninguno
fr: aucun
it: nessuno
ja: なし
pl: brak
pt_br: nenhum
ru: Нет
tr: yok
zh_hans: 无
zh_hant: 無
