Repository: dotnet/symreader-converter
Catalog: src/Pdb2Pdb/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Can't specify both /extract and /pdb options.
cs: Nelze zadat jak parametr /extract, tak parametr /pdb.
de: Die Optionen /extract und /pdb können nicht beide angegeben werden.
es: No se puede especificar las dos opciones /extract y /pdb.
fr: Impossible de spécifier à la fois les options /extract et /pdb.
it: Non è possibile specificare entrambe le opzioni /extract e /pdb.
ja: /extract オプションと /pdb オプションの両方を指定することはできません。
ko: /extract 및 /pdb 옵션을 모두 지정할 수 없습니다.
pl: Nie można określić jednocześnie obu opcji: /extract i /pdb.
pt_br: Não é possível especificar opções /extract e /pdb.
ru: Не удается указать оба параметра — /extract и /pdb.
tr: /extract ve /pdb seçeneklerinin ikisi birden belirtilemez.
zh_hans: 无法同时指定 /extract 和 /pdb 选项。
zh_hant: 不可同時指定 /extract 與 /pdb 選項。

source: Can't specify both /extract and /sourcelink options.
cs: Nelze zadat jak parametr /extract, tak parametr /sourcelink.
de: Die Optionen /extract und /sourcelink können nicht beide angegeben werden.
es: No se puede especificar las dos opciones /extract y /sourcelink.
fr: Impossible de spécifier à la fois les options /extract et /sourcelink.
it: Non è possibile specificare entrambe le opzioni /extract e /sourcelink.
ja: /extract オプションと /sourcelink オプションの両方を指定することはできません。
ko: /extract 및 /sourcelink 옵션을 모두 지정할 수 없습니다.
pl: Nie można określić jednocześnie obu opcji: /extract i /sourcelink.
pt_br: Não é possível especificar opções /extract e /sourcelink.
ru: Не удается указать оба параметра — /extract и /sourcelink.
tr: /extract ve /sourcelink seçeneklerinin ikisi birden belirtilemez.
zh_hans: 无法同时指定 /extract 和 /sourcelink 选项。
zh_hant: 不可同時指定 /extract 與 /sourcelink 選項。

# FileDoesntContainEmbeddedPdb
source: File '{0}' doesn't contain an embedded PDB.
cs: Soubor {0} neobsahuje vložený soubor PDB.
de: Die Datei "{0}" enthält keine eingebettete PDB.
es: El archivo "{0}" no contiene un archivo PDB insertado.
fr: Le fichier '{0}' ne contient pas de fichier PDB incorporé.
it: Il file '{0}' non contiene un PDB incorporato.
ja: ファイル '{0}' には、埋め込み PDB が含まれていません。
ko: '{0}' 파일에 포함된 PDB가 없습니다.
pl: Plik „{0}” nie zawiera osadzonego pliku PDB.
pt_br: O arquivo '{0}' não contém um PDB inserido.
ru: Файл "{0}" не содержит внедренный PDB.
tr: '{0}' dosyası eklenmiş bir PDB içermiyor.
zh_hans: 文件“{0}”没有内嵌的 PDB。
zh_hant: 檔案 '{0}' 未包含內嵌 PDB。

# FileNotFound
source: File not found: '{0}'
cs: Soubor {0} nebyl nalezen.
de: Datei nicht gefunden: "{0}"
es: No se encontró el archivo: "{0}".
fr: Fichier introuvable : '{0}'
it: File non trovato: '{0}'
ja: ファイルが見つかりません: '{0}'
ko: '{0}' 파일을 찾을 수 없습니다.
pl: Nie odnaleziono pliku: {0}.
pt_br: Arquivo não encontrado: '{0}'
ru: Файл не найден: "{0}"
tr: Dosya bulunamadı: '{0}'
zh_hans: 找不到文件:“{0}”
zh_hant: 找不到檔案: '{0}'

# MissingValueForOption
source: Missing value for option '{0}'
cs: Parametru {0} chybí hodnota.
de: Fehlender Wert für Option "{0}".
es: Falta el valor para la opción "{0}".
fr: Valeur manquante pour l'option '{0}'
it: Manca il valore per l'opzione '{0}'
ja: オプション '{0}' の値がありません
ko: '{0}' 옵션에 값이 없습니다.
pl: Brakująca wartość dla opcji „{0}”.
pt_br: Valor ausente para a opção '{0}'
ru: Отсутствует значение для параметра "{0}"
tr: '{0}' seçeneği için değer eksik
zh_hans: 缺少选项“{0}”的值
zh_hant: 遺漏選項 '{0}' 的值

source: Only one dll/exe can be specified
cs: Lze zadat jenom jeden soubor dll/exe.
de: Nur eine DLL/EXE kann angegeben werden.
es: Solo se puede especificar un dll/exe.
fr: Un seul fichier dll/exe peut être spécifié
it: È possibile specificare un solo file DLL/EXE
ja: 指定できるのは dll/exe 1 つだけです
ko: 하나의 dll/exe만 지정할 수 있습니다.
pl: Można określić tylko jeden plik dll/exe
pt_br: Apenas um dll/exe pode ser especificado
ru: Можно указать только один файл DLL/EXE
tr: Yalnızca bir dll/exe belirtilebilir
zh_hans: 只能指定一个 dll/exe
zh_hant: 只可指定一個 dll/exe

# UnrecognizedOption
source: Unrecognized option: '{0}'
cs: Nerozpoznaný parametr: {0}
de: Unbekannte Option: "{0}"
es: Opción no reconocida: '{0}'.
fr: Option non reconnue : '{0}'
it: Opzione non riconosciuta: '{0}'
ja: 認識されないオプション:'{0}'
ko: 인식할 수 없는 옵션: '{0}'
pl: Nierozpoznana opcja: „{0}”
pt_br: Opção não reconhecida: '{0}'
ru: Нераспознанный параметр: '{0}'
tr: Tanınmayan seçenek: '{0}'
zh_hans: 无法识别的选项:“{0}”
zh_hant: 選項無法辨認: '{0}'

source: Missing dll/exe path.
cs: Chybí cesta k souboru dll/exe.
de: Pfad zur DLL/EXE fehlt.
es: Falta la ruta de acceso dll/exe.
fr: Chemin du fichier dll/exe manquant.
it: Manca il percorso del file DLL/EXE.
ja: dll/exe のパスが見つかりせん。
ko: dll/exe 경로가 없습니다.
pl: Brak ścieżki do pliku dll/exe.
pt_br: Caminho dll/exe ausente.
ru: Отсутствует путь к файлу DLL/EXE.
tr: Dll/exe yolu eksik.
zh_hans: 缺少 dll/exe 路径。
zh_hant: 遺漏 dll/exe 路徑。

# MatchingPdbNotFound
source: File '{0}' not found or doesn't match '{1}'.
cs: Soubor {0} nebyl nalezen nebo neodpovídá {1}.
de: Die Datei "{0}" wurde nicht gefunden oder stimmt nicht mit "{1}" überein.
es: El archivo "{0}" no se encontró o no coincide con "{1}".
fr: Le fichier '{0}' est introuvable ou ne correspond pas à '{1}'.
it: Il file '{0}' non è stato trovato o non corrisponde a '{1}'.
ja: ファイル '{0}' が見つからないか、'{1}' と一致しません。
ko: '{0}' 파일을 찾을 수 없거나 '{1}'과(와) 일치하지 않습니다.
pl: Nie znaleziono pliku „{0}” lub jego nazwa nie jest zgodna z „{1}”.
pt_br: Arquivo '{0}' não encontrado ou não corresponde a '{1}'.
ru: Файл "{0}" не найден или не соответствует "{1}".
tr: '{0}' dosyası bulunamadı veya '{1}' ile eşleşmiyor.
zh_hans: 找不到文件“{0}”或与“{1}”不匹配。
zh_hant: 找不到檔案 '{0}' 或與 '{1}' 不符。

# NoAssociatedOrEmbeddedPdb
source: File '{0}' is neither associated with PDB nor does it embed PDB.
cs: Soubor {0} není přidružený k souboru PDB ani neobsahuje vložený soubor PDB.
de: Die Datei "{0}" ist weder der PDB zugeordnet, noch wird eine PDB eingebettet.
es: El archivo "{0}" no está asociado con el archivo PDB o no inserta el archivo PDB.
fr: Le fichier '{0}' n'est pas associé à un fichier PDB et n'incorpore pas de fichier PDB.
it: Il file '{0}' non è associato a PDB né lo incorpora.
ja: ファイル '{0}' が PDB に関連付けられていないか、このファイルに PDB が埋め込まれていません。
ko: '{0}' 파일이 PDB와 연결되지도 않았고 PDB를 포함하지도 않습니다.
pl: Plik „{0}” nie jest powiązany z plikiem PDB ani nie zawiera osadzonego pliku PDB.
pt_br: O arquivo '{0}' não está associado ao PDB nem insere o PDB.
ru: Файл "{0}" не связан с PDB и не содержит внедренный PDB.
tr: '{0}' dosyası PDB’yle ilişkili değil ve eklenmiş PDB içermiyor.
zh_hans: 文件“{0}”既不与 PDB 关联，也未嵌入 PDB。
zh_hant: 檔案 '{0}' 未與 PDB 相關聯，也沒有內嵌 PDB。

# Pdb2PdbUsage
source: Usage: Pdb2Pdb <dll/exe path> [/pdb <path>] [/out <path>] [/extract] /pdb <path> Path to the PDB to convert. If not specified explicitly, the PDB referenced by or embedded in the DLL/EXE is used. /out <path> Output PDB path. /extract Extract PDB embedded in the DLL/EXE. /sourcelink When converting to Windows PDB do not convert SourceLink to srcsrv format. By default both SourceLink and srcsrv are included in the converted PDB. /nowarn * Suppress all warnings. All warnings are reported by default. /nowarn <n1,n2,...> Suppress specified warning. /srcsvrvar <name>=<value> Add specified variable to srcsvr stream. Only applicable when converting to Windows PDB and /sourcelink is not specified. /extract and /pdb are mutually exclusive.
es: Uso: Pdb2Pdb <ruta de acceso dll/exe> [/pdb <ruta de acceso>] [/out <ruta de acceso>] [/extract] /pdb <ruta de acceso> Ruta de acceso al archivo PDB que se debe convertir. Si no se especifica de forma explícita, se usa el archivo PDB insertado o al que se hace referencia en el archivo DLL o EXE. /out <ruta de acceso> Ruta de acceso del archivo PDB de salida. /extract Extrae el archivo PDB insertado en el archivo DLL o EXE. /sourcelink En la conversión a PDB de Windows, SourceLink no se convierte al formato srcsrv. De forma predeterminada, se incluyen los dos (SourceLink y srcsrv) en el archivo PDB convertido. /nowarn * Suprime todas las advertencias. Todas las advertencias se notifican de manera predeterminada. /nowarn <n1,n2,...> Suprime la advertencia especificada. /srcsvrvar <nombre>=<valor> Agrega la variable especificada al flujo srcsvr. Solo aplicable al convertir a PDB de Windows y si /sourcelink no se ha especificado. /extract y /pdb se excluyen mutuamente.
fr: Utilisation : Pdb2Pdb <chemin dll/exe> [/pdb <chemin>] [/out <chemin>] [/extract] /pdb <chemin> Chemin du fichier PDB à convertir. S'il n'est pas spécifié explicitement, le fichier PDB référencé par le fichier DLL/EXE ou incorporé dans celui-ci est utilisé. /out <chemin> Chemin du fichier PDB de sortie. /extract Extraire le fichier PDB incorporé dans le fichier DLL/EXE. /sourcelink Quand vous effectuez la conversion vers un fichier PDB Windows, ne convertissez pas SourceLink au format srcsrv. Par défaut, SourceLink et srcsrv sont inclus dans le fichier PDB converti. /verbose Imprimer les diagnostics détaillés. /srcsvrvar <nom>=<valeur> Ajouter la variable spécifiée au flux srcsvr. Applicable uniquement pendant la conversion au format PDB Windows si /sourcelink n'est pas spécifié. /extract et /pdb s'excluent mutuellement.
pl: Użycie: Pdb2Pdb <ścieżka do pliku dll/exe> [/pdb <ścieżka>] [/out <ścieżka>] [/extract] /pdb <ścieżka> Ścieżka do pliku PDB do konwersji. Jeśli nie zostanie jawnie podana, używany jest plik PDB przywoływany przez plik DLL/EXE lub osadzony w nim. /out <ścieżka> Ścieżka wyjściowego pliku PDB. /extract Wyodrębnij plik PDB osadzony w pliku DLL/EXE. /sourcelink W przypadku konwertowania na plik PDB systemu Windows nie konwertuj linku źródłowego SourceLink na format srcsrv. Domyślnie do skonwertowanego pliku PDB jest dołączany zarówno link źródłowy, jak i strumień srcsrv. /nowarn * Pomiń wszystkie ostrzeżenia. Wszystkie ostrzeżenia są domyślnie zgłaszane. /nowarn <n1,n2,...> Pomiń określone ostrzeżenie. /srcsvrvar <nazwa>=<wartość> Dodaj określoną zmienną do strumienia srcsvr. Ma zastosowanie tylko podczas konwertowania pliku PDB systemu Windows, gdy opcja /sourcelink nie jest określona. Opcje /extract i /pdb wykluczają się wzajemnie.
ru: Использование: Pdb2Pdb <путь_к_dll/exe> [/pdb <путь>] [/out <путь>] [/extract] /pdb <путь> Путь к преобразуемому PDB-файлу. Если он не указан явно, используется PDB, указанный по ссылке или внедренный в файл DLL/EXE. /out <путь> Путь для вывода PDB. /extract Извлечение PDB, внедренного в DLL/EXE. /sourcelink Запрет преобразования SourceLink в формат srcsrv при преобразовании в PDB-файл Windows. По умолчанию преобразованный PDB включает и SourceLink, и srcsrv. /verbose Вывод подробных данных диагностики. /srcsvrvar <имя>=<значение> Добавление указанной переменной в поток srcsvr. Действует только при преобразовании в PDB-файл Windows и при отсутствии параметра /sourcelink. Параметры /extract и /pdb исключают друг друга.

# InvalidPdbPathInDebugDirectory
source: Invalid PDB path in Debug Directory (file '{0}').
cs: Cesta k souboru PDB v adresáři ladění (soubor {0}) je neplatná.
de: Ungültiger PDB-Pfad im Debugverzeichnis (Datei "{0}").
es: Ruta de acceso a PDB no válida en el directorio de depuración (archivo "{0}").
fr: Chemin PDB non valide dans le répertoire de débogage (fichier '{0}').
it: Il percorso del PDB nella directory di debug (file '{0}') non è valido.
ja: デバッグ ディレクトリ (ファイル '{0}') の PDB パスが無効です。
ko: 디버그 디렉터리('{0}' 파일)의 PDB 경로가 잘못되었습니다.
pl: Nieprawidłowa ścieżka do pliku PDB w katalogu debugowania (plik „{0}”).
pt_br: Caminho de PDB inválido no Diretório de depuração (arquivo '{0}').
ru: Недопустимый путь PDB в каталоге отладки (файл "{0}").
tr: Hata Ayıklama Dizininde ('{0}' dosyası) geçersiz PDB yolu.
zh_hans: 测试目录(文件“{0}”)中 PDB 路径无效。
zh_hant: 偵錯目錄 (檔案 '{0}') 中的 PDB 路徑無效。

# CantSpecifyBothSrcSvrVariableAndSourcelinkOptions
source: Can't specify both /srcsvrvar and /sourcelink options.
de: Die Optionen "/srcsvrvar" und "/sourcelink" können nicht gleichzeitig angegeben werden.
es: No se pueden especificar las opciones /srcsvrvar y /sourcelink simultáneamente.
fr: Impossible de spécifier les options /srcsvrvar et /sourcelink en même temps.
it: Non è possibile specificare entrambe le opzioni /srcsvrvar e /sourcelink.
ja: /srcsvrvar オプションと /sourcelink オプションの両方を指定することはできません。
ko: /srcsvrvar 및 /sourcelink 옵션을 모두 지정할 수 없습니다.
pl: Nie można określić obu opcji /srcsvrvar i /sourcelink.
pt_br: Não é possível especificar ambas as opções /srcsvrvar e /sourcelink.
ru: Невозможно указать сразу оба параметра /srcsvrvar и /sourcelink.
tr: /srcsvrvar ve /sourcelink seçenekleri birlikte belirtilemez.
zh_hans: 无法同时指定 /srcsvrvar 和 /sourcelink 选项。
zh_hant: 無法同時指定 /srcsvrvar 及 /sourcelink 選項。

# InvalidWarningNumber
source: Invalid warning number: '{0}'.
es: Número de advertencia "{0}" no válido.
pl: Nieprawidłowy numer ostrzeżenia: „{0}”.

# Pdb2PdbUsage
source: Usage: Pdb2Pdb <dll/exe path> [/pdb <path>] [/out <path>] [/extract] /pdb <path> Path to the PDB to convert. If not specified explicitly, the PDB referenced by or embedded in the DLL/EXE is used. /out <path> Output PDB path. /extract Extract PDB embedded in the DLL/EXE. /sourcelink When converting to Windows PDB do not convert SourceLink to srcsrv format. By default both SourceLink and srcsrv are included in the converted PDB. /nowarn <n1,n2,...> Suppress specified warning. All warnings are reported by default. /srcsvrvar <name>=<value> Add specified variable to srcsvr stream. Only applicable when converting to Windows PDB and /sourcelink is not specified. /extract and /pdb are mutually exclusive.
de: Syntax: Pdb2Pdb <dll/exe path> [/pdb <path>] [/out <path>] [/extract] /pdb <path> Pfad zur PDB, die konvertiert werden soll. Sofern nicht explizit angegeben, wird die in der DLL/EXE referenzierte oder eingebettete PDB verwendet. /out <path> Pfad für die Ausgabe-PDB. /extract In der DLL/EXE eingebettete PDB extrahieren. /sourcelink SourceLink beim Konvertieren in Windows-PDB nicht in das srcsrv-Format konvertieren. Standardmäßig werden sowohl SourceLink als auch srcsrv in die konvertierte PDB einbezogen. /verbose Detaillierte Diagnose ausgeben. /srcsvrvar <name>=<value> Angegebene Variable zu srcsvr-Stream hinzufügen. Gilt nur, wenn eine Konvertierung in eine Windows-PDB durchgeführt wird und /sourcelink nicht angegeben ist. /extract und /pdb schließen sich gegenseitig aus.
pt_br: Uso: Pdb2Pdb <caminho do dll/exe> [/pdb <caminho>] [/out <caminho>] [/extract] /pdb <caminho> Caminho do PDB a ser convertido. Se não for especificado explicitamente, o PDB referenciado pelo DLL/EXE ou nele inserido será usado. /out <caminho> Caminho do PDB de saída. /extract Extrair o PDB inserido no DLL/EXE. /sourcelink Ao converter para PDB do Windows, não converte SourceLink para um formato srcsrv. Por padrão, SourceLink e srcsrv são incluídos no PDB convertido. /verbose Imprimir diagnósticos detalhados. /srcsvrvar <nome>=<valor> Adicionar a variável especificada ao fluxo de srcsvr. Aplicável somente ao converter para o PDB do Windows sem que /sourcelink seja especificado. /extract e /pdb são mutuamente exclusivos.

# Pdb2PdbUsage
source: Usage: Pdb2Pdb <dll/exe path> [/pdb <path>] [/out <path>] [/extract] /pdb <path> Path to the PDB to convert. If not specified explicitly, the PDB referenced by or embedded in the DLL/EXE is used. /out <path> Output PDB path. /extract Extract PDB embedded in the DLL/EXE. /sourcelink Preserve Source Link when converting from Portable PDB to Windows PDB, instead of converting to srcsrv format. /verbose Print detailed diagnostics. /srcsvrvar <name>=<value> Add specified variable to srcsvr stream. Only applicable when converting to Windows PDB and /sourcelink is not specified. /extract and /pdb are mutually exclusive.
cs: Použití: Pdb2Pdb <cesta k souboru dll/exe> [/pdb <cesta>] [/out <cesta>] [/extract] /pdb <cesta> Cesta k souboru PDB, který se má převést. Pokud není zadaný explicitně, použije se soubor PDB, na který odkazuje soubor DLL/EXE nebo který je v něm vložený. /out <cesta> Cesta k výstupnímu souboru PDB /extract Extrahuje soubor PDB vložený v souboru DLL/EXE. /sourcelink Při převodu z formátu Portable PDB na Windows PDB zachová odkaz na zdroj místo převodu na formát srcsrv. /verbose Vypíše podrobnou diagnostiku. Parametry /extract a /pdb se vzájemně vylučují.
it: Sintassi: Pdb2Pdb <percorso DLL/EXE> [/pdb <percorso>] [/out <percorso>] [/extract] /pdb <percorso> Percorso del PDB da convertire. Se non è specificato in modo esplicito, viene usato il PDB a cui viene fatto riferimento o incorporato nel file DLL/EXE. /out <percorso> Percorso del PDB di output. /extract Estrae il PDB incorporato nel file DLL/EXE. /sourcelink Mantiene il collegamento all'origine quando si esegue la conversione da PDB portatile a PDB Windows, invece di eseguire la conversione in formato srcsrv. /verbose Stampa informazioni dettagliate sulla diagnostica. /srcsvrvar <nome>=<valore> Aggiunge la variabile specificata al flusso srcsvr. Applicabile solo durante la conversione in Windows PDB e l'opzione /sourcelink non è specificata. Le opzioni /extract e /pdb si escludono a vicenda.
zh_hant: 使用方式: Pdb2Pdb <dll/exe 路徑> [/pdb <路徑>] [/out <路徑>] [/extract] /pdb <路徑> 所要轉換之 PDB 的路徑。若未明確指定， 會使用 DLL/EXE 所參考或內嵌的 PDB。 /out <路徑> 輸出 PDB 路徑。 /extract 擷取內嵌於 DLL/EXE 的 PDB。 /sourcelink 從可攜式 PDB 轉換為 Windows PDB 時保留來源連結， 而非於轉換為 srcsrv 格式時進行保留。 /verbose 列印詳細診斷。 /srcsvrvar <名稱>=<值> 新增指定的變數到 srcsvr 資料流。僅於 轉換為 Windows PDB 且 /sourcelink 未指定 時適用。 /extract 與 /pdb 互斥。

# Pdb2PdbUsage
source: Usage: Pdb2Pdb <dll/exe path> [/pdb <path>] [/out <path>] [/extract] /pdb <path> Path to the PDB to convert. If not specified explicitly, the PDB referenced by or embedded in the DLL/EXE is used. /out <path> Output PDB path. /extract Extract PDB embedded in the DLL/EXE. /sourcelink When converting to Windows PDB do not convert SourceLink to srcsrv format. By default both SourceLink and srcsrv are included in the converted PDB. /verbose Print detailed diagnostics. /srcsvrvar <name>=<value> Add specified variable to srcsvr stream. Only applicable when converting to Windows PDB and /sourcelink is not specified. /extract and /pdb are mutually exclusive.
ja: 使い方: Pdb2Pdb <dll/exe のパス> [/pdb <パス>] [/out <パス>] [/extract] /pdb <パス> 変換する PDB へのパス。明示的に指定されない場合、DLL/EXE によって 参照される、または DLL/EXE に組み込まれている PDB が使用されます。 /out <パス> 出力 PDB パス。 /extract DLL/EXE に組み込まれている PDB を抽出します。 /sourcelink ポータブル PDB から Windows PDB に変換するときに、 srcsrv 形式に変換する代わりにソース リンクを保持します。 /verbose 詳しい診断を出力します。 /srcsvrvar <名前>=<値> 指定された変数を srcsvr ストリームに追加します。 変換先が Windows PDB であり、かつ /sourcelink が指定されない場合 にのみ適用できます。 /extract と /pdb を同時に指定することはできません。
ko: 사용법: Pdb2Pdb <dll/exe 경로> [/pdb <경로>] [/out <경로>] [/extract] /pdb <경로> 변환할 PDB 경로입니다. 명시적으로 지정되지 않을 경우 DLL/EXE에서 참조하거나 DLL/EXE에 포함된 PDB가 사용됩니다. /out <경로> 출력 PDB 경로입니다. /extract DLL/EXE에 포함된 PDB를 추출합니다. /sourcelink Windows PDB로 변환할 때 SourceLink를 srcsrv 형식으로 변환하지 마세요. 기본적으로 SourceLink 및 srcsrv 모두 변환된 PDB에 포함됩니다. /verbose 세부 진단을 인쇄합니다. /srcsvrvar <이름>=<값> srcsvr 스트림에 지정된 변수를 추가합니다. Windows PDB로 변환하고 /sourcelink가 지정되지 않았을 때만 해당합니다. /extract 및 /pdb를 함께 사용할 수 없습니다.
tr: Kullanım: Pdb2Pdb <dll/exe yolu> [/pdb <yol>] [/out <yol>] [/extract] /pdb <yol> Dönüştürülecek PDB’nin yolu. Açıkça belirtilmezse, DLL/EXE tarafından başvurulan veya DLL/EXE’ye gömülü PDB kullanılır. /out <yol> Çıkış PDB yolu. /extract DLL/EXE’ye gömülü PDB’yi ayıklayın. /sourcelink Taşınabilir PDB’den Windows PDB’ye dönüştürürken, srcsrv biçimine dönüştürmek yerine Kaynak Bağlantıyı koruyun. /verbose Ayrıntılı tanılamayı yazdırın. /srcsvrvar <ad>=<değer> Belirtilen değişkeni srcsvr akışına ekleyin. Yalnızca Windows PDB’ye dönüştürürken ve /sourcelink belirtilmediğinde geçerlidir. /extract ve /pdb birbirini dışlar.
zh_hans: 用法: Pdb2Pdb <dll/exe path> [/pdb <path>] [/out <path>] [/extract] /pdb <path> 待转换 PDB 的路径。如果未显式指定， 则会使用 DLL/EXE 所引用或 DLL/EXE 中嵌入的 PDB。 /out <path> 输出 PDB 路径。 /extract 提取 DLL/EXE 中嵌入的 PDB。 /sourcelink 从可移植 PDB 转换为 Windows PDB 时而不是在转换为 srcsrv 格式时， ，保留源链接。 /verbose 打印详细诊断。 /srcsvrvar <name>=<value> 将指定变量添加到 srcsvr 流。仅在转换为 Windows PDB 且未指定 /sourcelink 时 适用。 /extract 和 /pdb 相互排斥。
